Plan for **main** is ready.
**Branch/Commit:** refs/heads/main / ceadcc1e1040a1aa6fca365bbbc2d7ecb1cd433f
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/20149971323

**Plan (last ~500 lines):**
```
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-private-us-east-1c"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "karpenter.sh/discovery"              = "platform-prod"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/internal-elb"     = "1"
        }
      + tags_all                                       = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-private-us-east-1c"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "karpenter.sh/discovery"              = "platform-prod"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/internal-elb"     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.48.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-public-us-east-1a"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/elb"              = "1"
        }
      + tags_all                                       = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-public-us-east-1a"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/elb"              = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.49.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-public-us-east-1b"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/elb"              = "1"
        }
      + tags_all                                       = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-public-us-east-1b"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/elb"              = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.50.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-public-us-east-1c"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/elb"              = "1"
        }
      + tags_all                                       = {
          + "Environment"                         = "prod"
          + "ManagedBy"                           = "terraform"
          + "Name"                                = "platform-prod-public-us-east-1c"
          + "Owner"                               = "platform-team"
          + "Project"                             = "platform"
          + "Tier"                                = "critical"
          + "kubernetes.io/cluster/platform-prod" = "shared"
          + "kubernetes.io/role/elb"              = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.30.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSNodeAssumeRole"

          + principals {
              + identifiers = [
                  + "ec2.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "ami" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 5
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = true
      + load_balancers                   = (known after apply)
      + max_size                         = 8
      + metrics_granularity              = "1Minute"
      + min_size                         = 3
      + name                             = (known after apply)
      + name_prefix                      = "karpenter-prod-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 66
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag (known after apply)

      + timeouts {}

      + traffic_source (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + type              = "EC2_LINUX"
      + user_name         = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "karpenter-prod-node-group-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + unique_id   = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Self managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "karpenter-prod-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for karpenter-prod self managed node group"
      + id                     = (known after apply)
      + image_id               = (known after apply)
      + instance_type          = "t3.medium"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "karpenter-"
      + tags                   = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "prod"
              + "ManagedBy"   = "terraform"
              + "Name"        = "karpenter-prod"
              + "Owner"       = "platform-team"
              + "Project"     = "platform"
              + "Tier"        = "critical"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Environment" = "prod"
              + "ManagedBy"   = "terraform"
              + "Name"        = "karpenter-prod"
              + "Owner"       = "platform-team"
              + "Project"     = "platform"
              + "Tier"        = "critical"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment" = "prod"
              + "ManagedBy"   = "terraform"
              + "Name"        = "karpenter-prod"
              + "Owner"       = "platform-team"
              + "Project"     = "platform"
              + "Tier"        = "critical"
            }
        }
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 133 to add, 0 to change, 0 to destroy.
```
